# Seria 9: Łączenie danych z wielu obiektów DataFrame

## Łączenie danych z wielu obiektów DataFrame - wykład

In [2]:
import pandas as pd
import numpy as np

In [3]:
categories=pd.read_csv("./categories1.csv")
categories.head()

   CategoryID    CategoryName              Description
0           1       Beverages              Soft drinks
1           2      Condiments  Sweet and savory sauces
2           3     Confections                 Desserts
3           4  Dairy Products                  Cheeses
4           5  Grains/Cereals                   Breads

In [5]:
products=pd.read_csv("./products.csv")
products.head()

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,1,1,10 boxes x 20 bags,18.00,39,0,10,0
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,0
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1

In [10]:
suppliers=pd.read_csv("./suppliers.csv")
suppliers.head()

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
0,1,Exotic Liquids,Charlotte Cooper,Purchasing Manager,49 Gilbert St.,London,NaN,EC1 4SD,UK,(171) 555-2222,NaN,NaN
1,2,New Orleans Cajun Delights,Shelley Burke,Order Administrator,P.O. Box 78934,New Orleans,LA,70117,USA,(100) 555-4822,NaN,#CAJUN.HTM#
2,3,Grandma Kelly's Homestead,Regina Murphy,Sales Representative,707 Oxford Rd.,Ann Arbor,MI,48104,USA,(313) 555-5735,(313) 555-3349,NaN
3,4,Tokyo Traders,Yoshi Nagase,Marketing Manager,9-8 Sekimai Musashino-shi,Tokyo,NaN,100,Japan,(03) 3555-5011,NaN,NaN
4,5,Cooperativa de Quesos 'Las Cabras',Antonio del Valle Saavedra,Export Administrator,Calle del Rosal 4,Oviedo,Asturias,33007,Spain,(98) 598 76 54,NaN,NaN

In [11]:
customers=pd.read_csv("./customers.csv")
customers.head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,NaN,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constituci??n 2222,M?©xico D.F.,NaN,5021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquer?­a,Antonio Moreno,Owner,Mataderos 2312,M?©xico D.F.,NaN,5023,Mexico,(5) 555-3932,NaN
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,NaN,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbk?¶p,Christina Berglund,Order Administrator,Berguvsv?¤gen 8,Lule??,NaN,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

## 132. Concat i append - wykład

In [22]:
customers=pd.read_csv("./customers.csv", usecols=["CustomerID", "CompanyName", "Country"])
suppliers=pd.read_csv("./suppliers.csv", usecols=["SupplierID", "CompanyName", "Country"])

In [23]:
len(customers)

91

In [24]:
len(suppliers)

29

In [48]:
df_concatenated=pd.concat(objs=[suppliers, customers], ignore_index=True)

In [46]:
len(df_concatenated)

120

In [49]:
df_concatenated.head(40)

    SupplierID                             CompanyName      Country CustomerID
0          1.0                          Exotic Liquids           UK        NaN
1          2.0              New Orleans Cajun Delights          USA        NaN
2          3.0               Grandma Kelly's Homestead          USA        NaN
3          4.0                           Tokyo Traders        Japan        NaN
4          5.0      Cooperativa de Quesos 'Las Cabras'        Spain        NaN
5          6.0                                Mayumi's        Japan        NaN
6          7.0                            Pavlova Ltd.    Australia        NaN
7          8.0                 Specialty Biscuits Ltd.           UK        NaN
8          9.0                        PB Knäckebröd AB       Sweden        NaN
9         10.0               Refrescos Americanas LTDA       Brazil        NaN
10        11.0             Heli Süßwaren GmbH & Co. KG      Germany        NaN
11        12.0       Plutzer Lebensmittelgroßmärkte AG      Germany        NaN
12        13.0  Nord-Ost-Fisch Handelsgesellschaft mbH      Germany        NaN
13        14.0                 Formaggi Fortini s.r.l.        Italy        NaN
14        15.0                         Norske Meierier       Norway        NaN
15        16.0                       Bigfoot Breweries          USA        NaN
16        17.0                       Svensk Sjöföda AB       Sweden        NaN
17        18.0              Aux joyeux ecclésiastiques       France        NaN
18        19.0             New England Seafood Cannery          USA        NaN
19        20.0                            Leka Trading    Singapore        NaN
20        21.0                              Lyngbysild      Denmark        NaN
21        22.0                     Zaanse Snoepfabriek  Netherlands        NaN
22        23.0                               Karkki Oy      Finland        NaN
23        24.0                              G'day Mate    Australia        NaN
24        25.0                               Ma Maison       Canada        NaN
25        26.0                    Pasta Buttini s.r.l.        Italy        NaN
26        27.0                      Escargots Nouveaux       France        NaN
27        28.0                            Gai pâturage       France        NaN
28        29.0                        Forêts d'érables       Canada        NaN
29         NaN                     Alfreds Futterkiste      Germany      ALFKI
30         NaN      Ana Trujillo Emparedados y helados       Mexico      ANATR
31         NaN                Antonio Moreno Taquer?­a       Mexico      ANTON
32         NaN                         Around the Horn           UK      AROUT
33         NaN                     Berglunds snabbk?¶p       Sweden      BERGS
34         NaN                 Blauer See Delikatessen      Germany      BLAUS
35         NaN               Blondesddsl p?¨re et fils       France      BLONP
36         NaN              B??lido Comidas preparadas        Spain      BOLID
37         NaN                                Bon app'       France      BONAP
38         NaN                   Bottom-Dollar Markets       Canada      BOTTM
39         NaN                           B's Beverages           UK      BSBEV

In [51]:
customers2=customers.copy()

In [57]:
customers2.rename({"CustomerID":"SupplierID"},axis=1,inplace=True)

In [60]:
df_concatenated=pd.concat(objs=[suppliers,customers2], ignore_index=True)

In [63]:
df_concatenated.head(40)

   SupplierID                             CompanyName      Country
0           1                          Exotic Liquids           UK
1           2              New Orleans Cajun Delights          USA
2           3               Grandma Kelly's Homestead          USA
3           4                           Tokyo Traders        Japan
4           5      Cooperativa de Quesos 'Las Cabras'        Spain
5           6                                Mayumi's        Japan
6           7                            Pavlova Ltd.    Australia
7           8                 Specialty Biscuits Ltd.           UK
8           9                        PB Knäckebröd AB       Sweden
9          10               Refrescos Americanas LTDA       Brazil
10         11             Heli Süßwaren GmbH & Co. KG      Germany
11         12       Plutzer Lebensmittelgroßmärkte AG      Germany
12         13  Nord-Ost-Fisch Handelsgesellschaft mbH      Germany
13         14                 Formaggi Fortini s.r.l.        Italy
14         15                         Norske Meierier       Norway
15         16                       Bigfoot Breweries          USA
16         17                       Svensk Sjöföda AB       Sweden
17         18              Aux joyeux ecclésiastiques       France
18         19             New England Seafood Cannery          USA
19         20                            Leka Trading    Singapore
20         21                              Lyngbysild      Denmark
21         22                     Zaanse Snoepfabriek  Netherlands
22         23                               Karkki Oy      Finland
23         24                              G'day Mate    Australia
24         25                               Ma Maison       Canada
25         26                    Pasta Buttini s.r.l.        Italy
26         27                      Escargots Nouveaux       France
27         28                            Gai pâturage       France
28         29                        Forêts d'érables       Canada
29      ALFKI                     Alfreds Futterkiste      Germany
30      ANATR      Ana Trujillo Emparedados y helados       Mexico
31      ANTON                Antonio Moreno Taquer?­a       Mexico
32      AROUT                         Around the Horn           UK
33      BERGS                     Berglunds snabbk?¶p       Sweden
34      BLAUS                 Blauer See Delikatessen      Germany
35      BLONP               Blondesddsl p?¨re et fils       France
36      BOLID              B??lido Comidas preparadas        Spain
37      BONAP                                Bon app'       France
38      BOTTM                   Bottom-Dollar Markets       Canada
39      BSBEV                           B's Beverages           UK

## 133. LAB 2: Append i concat

In [65]:
mrbean=pd.read_csv("./mrbean_facebook_statuses_join.csv", usecols=['status_message_mrbean','status_type','num_likes'])

In [66]:
nasa=pd.read_csv("./nasa_facebook_statuses_join.csv", usecols=['status_message_nasa','status_type','num_likes'])

In [67]:
mrbean.head(1)

                               status_message_mrbean status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079

In [68]:
nasa.head(1)

                                 status_message_nasa status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142

In [69]:
mrbean.rename(columns={"status_message_mrbean":"status_message"},inplace=True)

In [70]:
nasa.rename(columns={"status_message_nasa":"status_message"},inplace=True)

In [72]:
mrbean.head(1)

                                      status_message status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079

In [73]:
nasa.head(1)

                                      status_message status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142

In [74]:
df_concatenated=pd.concat(objs=[mrbean,nasa],ignore_index=True)

In [78]:
df_concatenated.loc[[0]]

                                      status_message status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079

## 134. Join - wykład

In [82]:
product1=pd.read_csv("./products.csv", usecols=["ProductID", "ProductName"], index_col="ProductID")
product2=pd.read_csv("./products.csv", usecols=["ProductID", "UnitPrice", "UnitsInStock"], index_col="ProductID")

In [83]:
product1.head(1)

          ProductName
ProductID
1                Chai

In [84]:
product2.head(1)

           UnitPrice  UnitsInStock
ProductID
1               18.0            39

In [85]:
product1.join(product2).head(1)

          ProductName  UnitPrice  UnitsInStock
ProductID
1                Chai       18.0            39

In [104]:
products=pd.read_csv("./products.csv", usecols=["ProductID","ProductName","UnitPrice","CategoryID"])
categories=pd.read_csv("./categories1.csv", usecols=["CategoryID","CategoryName","Description"])

In [105]:
products.head(1)

   ProductID ProductName  CategoryID  UnitPrice
0          1        Chai           1       18.0

In [106]:
categories.head(1)

   CategoryID CategoryName  Description
0           1    Beverages  Soft drinks

In [107]:
categories.set_index("CategoryID", inplace=True)

In [108]:
categories.head(1)

           CategoryName  Description
CategoryID
1             Beverages  Soft drinks

In [110]:
products.join(other=categories, on="CategoryID").head(10)

,ProductID,ProductName,CategoryID,UnitPrice,CategoryName,Description
0,1,Chai,1,18.00,Beverages,Soft drinks
1,2,Chang,1,19.00,Beverages,Soft drinks
2,3,Aniseed Syrup,2,10.00,Condiments,Sweet and savory sauces
3,4,Chef Anton's Cajun Seasoning,2,22.00,Condiments,Sweet and savory sauces
4,5,Chef Anton's Gumbo Mix,2,21.35,Condiments,Sweet and savory sauces
5,6,Grandma's Boysenberry Spread,2,25.00,Condiments,Sweet and savory sauces
6,7,Uncle Bob's Organic Dried Pears,7,30.00,Produce,Dried fruit and bean curd
7,8,Northwoods Cranberry Sauce,2,40.00,Condiments,Sweet and savory sauces
8,9,Mishi Kobe Niku,6,97.00,Meat/Poultry,Prepared meats
9,10,Ikura,8,31.00,Seafood,Seaweed and fish

## 135. LAB 3: Join

In [140]:
customer_names=pd.read_csv("./customers.csv", usecols=["CustomerID", "CompanyName"])
customer_cities=pd.read_csv("./customers.csv", usecols=["CustomerID", "City", "Country"])

In [141]:
len(customer_names)

91

In [142]:
len(customer_cities)

91

In [143]:
customer_names.head(1)

  CustomerID          CompanyName
0      ALFKI  Alfreds Futterkiste

In [144]:
customer_cities.head(5)

  CustomerID          City  Country
0      ALFKI        Berlin  Germany
1      ANATR  M?©xico D.F.   Mexico
2      ANTON  M?©xico D.F.   Mexico
3      AROUT        London       UK
4      BERGS        Lule??   Sweden

In [145]:
customer_names.set_index("CustomerID", inplace=True)

In [146]:
customer_cities.set_index("CustomerID", inplace=True)

In [147]:
len(customer_names.join(other=customer_cities, on="CustomerID"))

91

In [148]:
len(customer_names.join(other=customer_cities, on="CustomerID"))

91

In [150]:
customer_names.join(other=customer_cities).head(5)

                                   CompanyName          City  Country
CustomerID
ALFKI                      Alfreds Futterkiste        Berlin  Germany
ANATR       Ana Trujillo Emparedados y helados  M?©xico D.F.   Mexico
ANTON                 Antonio Moreno Taquer?­a  M?©xico D.F.   Mexico
AROUT                          Around the Horn        London       UK
BERGS                      Berglunds snabbk?¶p        Lule??   Sweden

In [151]:
customer_names.reset_index(inplace=True)

In [152]:
customer_names.join(other=customer_cities, on="CustomerID")

   CustomerID                         CompanyName          City  Country
0       ALFKI                 Alfreds Futterkiste        Berlin  Germany
1       ANATR  Ana Trujillo Emparedados y helados  M?©xico D.F.   Mexico
2       ANTON            Antonio Moreno Taquer?­a  M?©xico D.F.   Mexico
3       AROUT                     Around the Horn        London       UK
4       BERGS                 Berglunds snabbk?¶p        Lule??   Sweden
..        ...                                 ...           ...      ...
86      WARTH                      Wartian Herkku          Oulu  Finland
87      WELLI              Wellington Importadora       Resende   Brazil
88      WHITC                White Clover Markets       Seattle      USA
89      WILMK                         Wilman Kala      Helsinki  Finland
90      WOLZA                      Wolski  Zajazd      Warszawa   Poland

[91 rows x 4 columns]

## 136. Merge - wykład

In [153]:
cat1=pd.read_csv("./categories_del_1.csv", usecols=["CategoryID","CategoryName"])
cat2=pd.read_csv("./categories_del_2.csv", usecols=["CategoryID","CategoryName"])

In [154]:
cat1.head()

   CategoryID    CategoryName
0           2      Condiments
1           3     Confections
2           4  Dairy Products
3           5  Grains/Cereals
4           6    Meat/Poultry

In [155]:
cat2.head()

   CategoryID    CategoryName
0           1       Beverages
1           2      Condiments
2           3     Confections
3           4  Dairy Products
4           7         Produce

In [158]:
cat1.merge(cat2, on="CategoryID", suffixes=["_1","_2"], how="inner", indicator=True)

   CategoryID  CategoryName_1  CategoryName_2 _merge
0           2      Condiments      Condiments   both
1           3     Confections     Confections   both
2           4  Dairy Products  Dairy Products   both
3           7         Produce         Produce   both
4           8         Seafood         Seafood   both

In [157]:
cat1.merge(cat2, on="CategoryID", suffixes=["_1","_2"], how="outer", indicator=True)

   CategoryID  CategoryName_1  CategoryName_2      _merge
0           2      Condiments      Condiments        both
1           3     Confections     Confections        both
2           4  Dairy Products  Dairy Products        both
3           5  Grains/Cereals             NaN   left_only
4           6    Meat/Poultry             NaN   left_only
5           7         Produce         Produce        both
6           8         Seafood         Seafood        both
7           1             NaN       Beverages  right_only

In [159]:
cat1.merge(cat2, on="CategoryID", suffixes=["_1","_2"], how="left", indicator=True)

   CategoryID  CategoryName_1  CategoryName_2     _merge
0           2      Condiments      Condiments       both
1           3     Confections     Confections       both
2           4  Dairy Products  Dairy Products       both
3           5  Grains/Cereals             NaN  left_only
4           6    Meat/Poultry             NaN  left_only
5           7         Produce         Produce       both
6           8         Seafood         Seafood       both

In [160]:
cat1.merge(cat2, on="CategoryID", suffixes=["_1","_2"], how="right", indicator=True)

   CategoryID  CategoryName_1  CategoryName_2      _merge
0           1             NaN       Beverages  right_only
1           2      Condiments      Condiments        both
2           3     Confections     Confections        both
3           4  Dairy Products  Dairy Products        both
4           7         Produce         Produce        both
5           8         Seafood         Seafood        both

In [176]:
cat_merged=cat1.merge(cat2, on="CategoryID", suffixes=["_1","_2"], how="outer", indicator=True)

In [181]:
filter=cat_merged["_merge"]=="right_only"
filter

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
Name: _merge, dtype: bool

In [182]:
cat_merged[filter]

   CategoryID CategoryName_1 CategoryName_2      _merge
7           1            NaN      Beverages  right_only

## 137. LAB 4: Merge

In [184]:
f_2015=pd.read_csv("./Fortune_500_2015.csv", usecols=["rank","company"])
f_2016=pd.read_csv("./Fortune_500_2016.csv", usecols=["rank","company"])

In [185]:
f_2015.head()

   rank             company
0     1             Walmart
1     2         Exxon Mobil
2     3             Chevron
3     4  Berkshire Hathaway
4     5               Apple

In [189]:
companies_2015_2016=f_2015.merge(f_2016, on="company", suffixes=["_2015","_2016"], how="outer", indicator=True)
companies_2015_2016

     rank_2015                   company  rank_2016      _merge
0          1.0                   Walmart        1.0        both
1          2.0               Exxon Mobil        2.0        both
2          3.0                   Chevron       14.0        both
3          4.0        Berkshire Hathaway        4.0        both
4          5.0                     Apple        3.0        both
..         ...                       ...        ...         ...
529        NaN  Telephone & Data Systems      496.0  right_only
530        NaN  First American Financial      497.0  right_only
531        NaN                       NVR      498.0  right_only
532        NaN      Cincinnati Financial      499.0  right_only
533        NaN         Burlington Stores      500.0  right_only

[534 rows x 4 columns]

In [196]:
companies_2015_2016=companies_2015_2016[["company","rank_2015","rank_2016","_merge"]]
companies_2015_2016

                      company  rank_2015  rank_2016      _merge
0                     Walmart        1.0        1.0        both
1                 Exxon Mobil        2.0        2.0        both
2                     Chevron        3.0       14.0        both
3          Berkshire Hathaway        4.0        4.0        both
4                       Apple        5.0        3.0        both
..                        ...        ...        ...         ...
529  Telephone & Data Systems        NaN      496.0  right_only
530  First American Financial        NaN      497.0  right_only
531                       NVR        NaN      498.0  right_only
532      Cincinnati Financial        NaN      499.0  right_only
533         Burlington Stores        NaN      500.0  right_only

[534 rows x 4 columns]

In [200]:
companies_2015_2016[companies_2015_2016["company"]=="Microsoft"]

      company  rank_2015  rank_2016 _merge
30  Microsoft       31.0       25.0   both

In [204]:
filter2015=companies_2015_2016["_merge"]=="left_only"
only_2015=companies_2015_2016[filter2015]
only_2015.head()

                     company  rank_2015  rank_2016     _merge
83                   Safeway       84.0        NaN  left_only
94                   DirecTV       95.0        NaN  left_only
124                    Alcoa      125.0        NaN  left_only
164                    Kraft      165.0        NaN  left_only
174  TRW Automotive Holdings      175.0        NaN  left_only

In [205]:
filter2016=companies_2015_2016["_merge"]=="right_only"
only_2016=companies_2015_2016[filter2016]
only_2016.head()

                    company  rank_2015  rank_2016      _merge
500                 Arconic        NaN      126.0  right_only
501             Kraft Heinz        NaN      153.0  right_only
502  Performance Food Group        NaN      185.0  right_only
503   Hertz Global Holdings        NaN      269.0  right_only
504         PayPal Holdings        NaN      307.0  right_only

## 138. Merge outer - wykład

In [206]:
products=pd.read_csv("./products.csv", usecols=["ProductID","ProductName"])
orderedProducts=pd.read_csv("./order-details_del.csv", usecols=["OrderID","ProductID","UnitPrice","Quantity"])

In [207]:
products.head(1)

   ProductID ProductName
0          1        Chai

In [209]:
orderedProducts.head(1)

   OrderID  ProductID  UnitPrice  Quantity
0    10331         54        5.9        15

In [217]:
products.merge(orderedProducts, on="ProductID", how="outer", indicator=True).head()

   ProductID ProductName  OrderID  UnitPrice  Quantity _merge
0          1        Chai  10348.0       14.4      15.0   both
1          1        Chai  10354.0       14.4      12.0   both
2          1        Chai  10370.0       14.4      15.0   both
3          1        Chai  10406.0       14.4      10.0   both
4          1        Chai  10413.0       14.4      24.0   both

In [219]:
products_merged=products.merge(orderedProducts, on="ProductID", how="outer", indicator=True)
filter=products_merged["_merge"]=="left_only"
products_merged[filter]

,ProductID,ProductName,OrderID,UnitPrice,Quantity,_merge
16,6,Grandma's Boysenberry Spread,NaN,NaN,NaN,left_only
38,15,Genen Shouyu,NaN,NaN,NaN,left_only
85,27,Schoggi Schokolade,NaN,NaN,NaN,left_only
242,66,Louisiana Hot Spiced Okra,NaN,NaN,NaN,left_only
243,67,Laughing Lumberjack Lager,NaN,NaN,NaN,left_only

## 139. LAB 5: Merge outer

In [5]:
import pandas as pd

suppliers=pd.read_csv("./suppliers _del_1.csv", usecols=["SupplierID","CompanyName","City"])
products=pd.read_csv("./products_del_1.csv", usecols=["ProductID","ProductName","SupplierID"])

In [6]:
suppliers.head(1)

   SupplierID     CompanyName    City
0           1  Exotic Liquids  London

In [7]:
products.head(1)

   ProductID ProductName  SupplierID
0          1        Chai           1

In [10]:
suppliers.merge(products, on="SupplierID", how="inner", indicator=True).head(1)

   SupplierID     CompanyName    City  ProductID ProductName _merge
0           1  Exotic Liquids  London          1        Chai   both

In [11]:
prod_and_sup=suppliers.merge(products, on="SupplierID", how="inner", indicator=True)

In [14]:
len(suppliers)

27

In [15]:
len(products)

75

In [16]:
len(prod_and_sup)

70

In [17]:
prod_and_sup_outer=suppliers.merge(products, on="SupplierID", how="outer", indicator=True)

In [18]:
prod_and_sup_outer.head(1)

   SupplierID     CompanyName    City  ProductID ProductName _merge
0           1  Exotic Liquids  London        1.0        Chai   both

In [23]:
prod_and_sup_outer["_merge"].value_counts()

both          70
right_only     5
left_only      1
Name: _merge, dtype: int64

In [19]:
filterRight=prod_and_sup_outer["_merge"]=="right_only"

In [20]:
prod_and_sup_outer[filterRight]

    SupplierID CompanyName City  ProductID          ProductName      _merge
71           9         NaN  NaN       22.0  Gustaf's Knäckebröd  right_only
72           9         NaN  NaN       23.0             Tunnbröd  right_only
73          17         NaN  NaN       36.0          Inlagd Sill  right_only
74          17         NaN  NaN       37.0           Gravad lax  right_only
75          17         NaN  NaN       73.0           Röd Kaviar  right_only

In [21]:
filterLeft=prod_and_sup_outer["_merge"]=="left_only"

In [22]:
prod_and_sup_outer[filterLeft]

    SupplierID         CompanyName      City  ProductID ProductName     _merge
67          27  Escargots Nouveaux  Montceau        NaN         NaN  left_only

## 140. Left & Right Merge - wykład

In [25]:
products=pd.read_csv("./products.csv", usecols=["ProductID","ProductName"])
orderedProducts=pd.read_csv("./order-details_del.csv", usecols=["OrderID","ProductID","UnitPrice","Quantity"])

In [26]:
products.head(1)

   ProductID ProductName
0          1        Chai

In [27]:
orderedProducts.head(1)

   OrderID  ProductID  UnitPrice  Quantity
0    10331         54        5.9        15

In [29]:
products.merge(orderedProducts, on="ProductID", how="left", indicator=True).head(1)

   ProductID ProductName  OrderID  UnitPrice  Quantity _merge
0          1        Chai  10348.0       14.4      15.0   both

In [30]:
merged=products.merge(orderedProducts, on="ProductID", how="left", indicator=True)

In [36]:
merged["_merge"].value_counts()

both          289
left_only       5
right_only      0
Name: _merge, dtype: int64

In [37]:
filter=merged["_merge"]=="left_only"
merged[filter]

,ProductID,ProductName,OrderID,UnitPrice,Quantity,_merge
16,6,Grandma's Boysenberry Spread,NaN,NaN,NaN,left_only
38,15,Genen Shouyu,NaN,NaN,NaN,left_only
85,27,Schoggi Schokolade,NaN,NaN,NaN,left_only
242,66,Louisiana Hot Spiced Okra,NaN,NaN,NaN,left_only
243,67,Laughing Lumberjack Lager,NaN,NaN,NaN,left_only

In [38]:
merged2=orderedProducts.merge(products, on="ProductID", how="right", indicator=True)

In [39]:
merged2.head(1)

   OrderID  ProductID  UnitPrice  Quantity ProductName _merge
0  10348.0          1       14.4      15.0        Chai   both

In [40]:
merged2["_merge"].value_counts()

both          289
right_only      5
left_only       0
Name: _merge, dtype: int64

In [41]:
filterRight=merged2["_merge"]=="right_only"
merged2[filter]

,OrderID,ProductID,UnitPrice,Quantity,ProductName,_merge
16,NaN,6,NaN,NaN,Grandma's Boysenberry Spread,right_only
38,NaN,15,NaN,NaN,Genen Shouyu,right_only
85,NaN,27,NaN,NaN,Schoggi Schokolade,right_only
242,NaN,66,NaN,NaN,Louisiana Hot Spiced Okra,right_only
243,NaN,67,NaN,NaN,Laughing Lumberjack Lager,right_only

## 141. LAB 6: Left & Right Merge - wykład

In [44]:
suppliers=pd.read_csv("./suppliers.csv", usecols=["SupplierID", "CompanyName", "City"])
products=pd.read_csv("./products_del_2.csv", usecols=["ProductID", "ProductName", "SupplierID"])

In [46]:
suppliers.merge(products, on="SupplierID", how="left", indicator=True).head(1)

   SupplierID     CompanyName    City  ProductID ProductName _merge
0           1  Exotic Liquids  London        1.0        Chai   both

In [47]:
sup_prod=suppliers.merge(products, on="SupplierID", how="left", indicator=True)

In [49]:
len(suppliers)

29

In [50]:
len(products)

68

In [51]:
len(sup_prod)

70

In [48]:
filter=sup_prod["_merge"]=="left_only"
sup_prod[filter]

,SupplierID,CompanyName,City,ProductID,ProductName,_merge
2,2,New Orleans Cajun Delights,New Orleans,NaN,NaN,left_only
67,27,Escargots Nouveaux,Montceau,NaN,NaN,left_only

## 142. Opcje polecenia merge - wykład

## 143. LAB 7: Opcje polecenia merge

In [52]:
suppliers=pd.read_csv("./suppliers.csv", usecols=["SupplierID", "CompanyName", "City"])
products=pd.read_csv("./products_del_2.csv", usecols=["ProductID", "ProductName", "SupplierID"])

In [54]:
suppliers.merge(products, on="SupplierID", how="inner", indicator=True).head(1)

   SupplierID     CompanyName    City  ProductID ProductName _merge
0           1  Exotic Liquids  London          1        Chai   both

In [62]:
suppliers.rename({"SupplierID":"SuppID"}, axis=1, inplace=True)

In [67]:
suppliers.head(1)

   SuppID     CompanyName    City
0       1  Exotic Liquids  London

In [65]:
suppliers.merge(products, left_on="SuppID", right_on="SupplierID", how="inner", indicator=True).head(1)

   SuppID     CompanyName    City  ProductID ProductName  SupplierID _merge
0       1  Exotic Liquids  London          1        Chai           1   both

In [69]:
suppliers.set_index("SuppID", inplace=True)

In [70]:
suppliers.head(1)

           CompanyName    City
SuppID
1       Exotic Liquids  London

In [73]:
suppliers.merge(products, how="inner", right_on="SupplierID", left_index=True).head(1)

      CompanyName    City  ProductID ProductName  SupplierID
0  Exotic Liquids  London          1        Chai           1

## 144. Łączenie trzech i więcej DataFrame - wykład

In [79]:
products=pd.read_csv("./products.csv", usecols=["ProductID", "ProductName", "CategoryID","UnitPrice"])

In [78]:
categories=pd.read_csv("./categories1.csv", usecols=["CategoryID","CategoryName","Description"])

In [77]:
orders=pd.read_csv("./order-details.csv")

In [80]:
products.head(1)

   ProductID ProductName  CategoryID  UnitPrice
0          1        Chai           1       18.0

In [81]:
categories.head(1)

   CategoryID CategoryName  Description
0           1    Beverages  Soft drinks

In [82]:
orders.head(1)

   OrderID  ProductID  UnitPrice  Quantity  Discount
0    10248         11       14.0        12       0.0

In [83]:
prod_cat=products.merge(categories)

In [84]:
prod_cat.head(1)

   ProductID ProductName  CategoryID  UnitPrice CategoryName  Description
0          1        Chai           1       18.0    Beverages  Soft drinks

In [89]:
prod_cat_ord=prod_cat.merge(orders, on="ProductID", suffixes=["_Prod","_Order"])

In [90]:
prod_cat_ord.head(1)

,ProductID,ProductName,CategoryID,UnitPrice_Prod,CategoryName,Description,OrderID,UnitPrice_Order,Quantity,Discount
0,1,Chai,1,18.0,Beverages,Soft drinks,10285,14.4,45,0.2

## 145. LAB: Łączenie trzech i więcej DataFrame